"""Завдання 4 (необов'язкове завдання).
Реалізуйте структуру даних для системи коментарів так, щоб коментарі могли 
мати відповіді, які, в свою чергу, також могли мати відповіді, формуючи 
таким чином ієрархічну структуру.

Також візьміть до уваги наступні вимоги:
Реалізуйте клас Comment, що представляє собою окремий коментар. Він має 
зберігати текст коментаря, автора та список відповідей.
Метод класу add_reply має додавати нову відповідь до коментаря.
Метод класу remove_reply має видаляти відповідь із коментаря. Це має змінювати 
текст коментаря на стандартне повідомлення (наприклад, "Цей коментар було 
видалено.") і встановлювати прапорець is_deleted в True.
Метод display має рекурсивно виводити коментар та всі його відповіді, 
використовуючи відступи для відображення ієрархічної структури."""

class Comment:
    """Ініціалізує об'єкт коментаря з текстом, автором і порожнім списком відповідей."""
    def __init__(self, text, author):
        self.text = text
        self.author = author
        self.replies = []
        self.is_deleted = False

    def add_reply(self, reply):
        """Додає відповідь до списку відповідей коментаря."""
        self.replies.append(reply)

    def remove_reply(self):
        """Видаляє текст коментаря і встановлює прапорець is_deleted в True."""
        self.text = "Цей коментар було видалено."
        self.is_deleted = True

    def display(self, indent=0):
        """Рекурсивно виводить коментар і всі його відповіді з відповідними відступами."""
        if not self.is_deleted:
            print("    " * indent + f"{self.author}: {self.text}")
        else:
            print("    " * indent + "Цей коментар було видалено.")
        for reply in self.replies:
            reply.display(indent + 1)

# Приклад використання:
root_comment = Comment("Яка чудова книга!", "Бодя")  # Створюємо кореневий коментар
reply1 = Comment("Книга повне розчарування :(", "Андрій")  # Створюємо першу відповідь
reply2 = Comment("Що в ній чудового?", "Марина")  # Створюємо другу відповідь

root_comment.add_reply(reply1)  # Додаємо першу відповідь до кореневого коментаря
root_comment.add_reply(reply2)  # Додаємо другу відповідь до кореневого коментаря

reply1_1 = Comment("Не книжка, а перевели купу паперу ні нащо...", "Сергій") # Створюємо 
# відповідь на першу відповідь
reply1.add_reply(reply1_1)  # Додаємо відповідь на першу відповідь

reply1.remove_reply()  # Видаляємо першу відповідь

root_comment.display()  # Виводимо кореневий коментар разом з усіма відповідями
